// TARGILIM //

// כתוב פונקציה שמקבלת 3 צלעות של משולש ומחזירה את שטח המשולש

// כתוב פונקציה שמקבלת מחרוזת ומחזירה את המחרוזת הפוך
// Example: string = "yotam" || myFunc(string) = "matoy"

// משחק הניחושים: כתוב תוכנה שקולטת מהלקוח מספרים. בעבור כל מספר שיכניס הלקוח, יוגרל מספר רנדומלי מ1 ל 100. אם קלט הלקוח תואם למספר שהוגרל, יודפס אמת, אחרת יודפס שקר. הקלט יפסק כשהלקוח יזין -1
// * הערה: להיעזר בגוגל כדי להגריל מספר רנדומלי *

// כתוב תוכניות שקולטת מהלקוח צמדים של מספרים, ומדפיסה אמת אם הסכום שלהם גדול מ50. הקלט יפסק כשהלקוח יזין -1 ו -2 לשני המספרים שנקלטו

// כתוב פונקציה שמקבלת שני מספרים ומדפיסה:
// את המספר הגדול מהשניים
// את המספר הקטן מהשניים
// את הראשון בחזקת השני
// את השורש הריבועי של שני המספרים
// ! חובה להשתמש בספריה .Math() ! //
// * היעזר בגוגל לגבי הספריה * //

// כתוב תוכנית שמדפיסה את כל התאריכים בשבוע הקרוב בפורמט הבא:
// MM/DD/YYYY
// * למד איך לעבוד עם תאריכים. חפש בגוגל * //

// כתוב פונקציה שמקבלת מחרוזת.
// הפונקציה תחזיר את המחרוזת ללא מספרים
// Example: string = "13he5ll3o" | myFunc(string) = "hello" |||| string = "test" | myFunc(string) = "test"